#pragma once

// Name: ARKSotF, Version: 178.8.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum ShooterGame.ESTOFNotificationType
enum class ESTOFNotificationType : uint8_t
{
	ESTOFNotificationType__Death   = 0,
	ESTOFNotificationType__MatchVictory = 1,
	ESTOFNotificationType__MAX     = 2,
	ESlateColorStylingMode__UseColor_Specified = 3,
	ESlateColorStylingMode__UseColor_Foreground = 4,
	ESlateColorStylingMode__UseColor_MAX = 5
};


// Enum ShooterGame.EPrimalARKTributeDataType
enum class EPrimalARKTributeDataType : uint8_t
{
	EPrimalARKTributeDataType__Items = 0,
	EPrimalARKTributeDataType__CharacterData = 1,
	EPrimalARKTributeDataType__EPrimalARKTributeDataType_MAX = 2,
	HAlign_Fill                    = 3,
	HAlign_Center                  = 4
};


// Enum ShooterGame.EPrimalCharacterStatusValue
enum class EPrimalCharacterStatusValue : uint8_t
{
	EPrimalCharacterStatusValue__Health = 0,
	EPrimalCharacterStatusValue__Torpidity = 1,
	EPrimalCharacterStatusValue__Food = 2,
	EPrimalCharacterStatusValue__Temperature = 3,
	EPrimalCharacterStatusValue__MeleeDamageMultiplier = 4,
	EPrimalCharacterStatusValue__TemperatureFortitude = 5,
	EPrimalCharacterStatusValue__MAX = 6,
	ETribeGroupPermission__STRUCTUREACTIVATE = 7,
	ETribeGroupPermission__PET_ORDER = 8,
	ETribeGroupPermission__GENERAL_STRUCTUREDEMOLISH = 9,
	ETribeGroupPermission__GENERAL_BUILDSTRUCTUREINRANGE = 10,
	ETribeGroupPermission__PROMOTEMEMBER = 11,
	ETribeGroupPermission__BANISHMEMBER = 12,
	ETribeGroupPermission__ETribeGroupPermission_MAX = 13
};


// Enum ShooterGame.EChatMessageType
enum class EChatMessageType : uint8_t
{
	EChatMessageType__MyMessage    = 0,
	EChatMessageType__DifferentTeamMessage = 1,
	EChatMessageType__NotificationMessage = 2,
	EChatMessageType__EChatMessageType_MAX = 3
};


// Enum ShooterGame.EChatType
enum class EChatType : uint8_t
{
	EChatType__GlobalChat          = 0,
	EChatType__RadioChat           = 1,
	EChatType__Notification        = 2,
	EChatType__EChatType_MAX       = 3,
	EPathFollowingResult__Success  = 4,
	EPathFollowingResult__OffPath  = 5,
	EPathFollowingResult__Skipped  = 6
};


// Enum ShooterGame.EShooterPhysMaterialType
enum class EShooterPhysMaterialType : uint8_t
{
	EShooterPhysMaterialType__Unknown = 0,
	EShooterPhysMaterialType__Dirt = 1,
	EShooterPhysMaterialType__Metal = 2,
	EShooterPhysMaterialType__Grass = 3,
	EShooterPhysMaterialType__Flesh = 4,
	EShooterPhysMaterialType__Rock = 5,
	EShooterPhysMaterialType__Snow = 6,
	EShooterPhysMaterialType__EShooterPhysMaterialType_MAX = 7
};


// Enum ShooterGame.EPlayerActionIndex
enum class EPlayerActionIndex : uint8_t
{
	EPlayerActionIndex__None       = 0,
	EPlayerActionIndex__WhistleFollowOne = 1,
	EPlayerActionIndex__WhistleStopOne = 2,
	EPlayerActionIndex__WhistleNeutral = 3,
	EPlayerActionIndex__WhistleAttackTarget = 4,
	EPlayerActionIndex__ShowCraftables = 5,
	EPlayerActionIndex__Poop       = 6,
	EPlayerActionIndex__Emote_Salute = 7,
	EPlayerActionIndex__Emote_Thank = 8,
	EPlayerActionIndex__Emote_Laugh = 9,
	EPlayerActionIndex__Emote_No   = 10,
	EPlayerActionIndex__Emote_Cheer = 11,
	EPlayerActionIndex__EPlayerActionIndex_MAX = 12
};


// Enum ShooterGame.PrimalGameData.EPrimalCharacterStatusState
enum class EPrimalCharacterStatusState : uint8_t
{
	EPrimalCharacterStatusState__Dead = 0,
	EPrimalCharacterStatusState__Starvation = 1,
	EPrimalCharacterStatusState__Suffocation = 2,
	EPrimalCharacterStatusState__Hypothermia = 3,
	EPrimalCharacterStatusState__Injured = 4,
	EPrimalCharacterStatusState__Sleeping = 5,
	EPrimalCharacterStatusState__Hot = 6,
	EPrimalCharacterStatusState__Suicide = 7,
	EPrimalCharacterStatusState__MAX = 8,
	EServerOctreeGroup__STASISCOMPONENTS = 9,
	EServerOctreeGroup__DINOPAWNS  = 10,
	EServerOctreeGroup__STRUCTURES = 11,
	EServerOctreeGroup__SPATIALNETWORKEDACTORS = 12,
	EServerOctreeGroup__ALL_SPATIAL = 13,
	EServerOctreeGroup__STRUCTURES_CORE = 14,
	EServerOctreeGroup__PLAYERS_AND_TAMED_DINOS = 15,
	EServerOctreeGroup__GRENADES   = 16
};


// Enum ShooterGame.PrimalGameData.EPrimalConsumableType
enum class EPrimalConsumableType : uint8_t
{
	EPrimalConsumableType__Food    = 0,
	EPrimalConsumableType__Medicine = 1,
	EPrimalConsumableType__MAX     = 2,
	ELevelExperienceRampType__Player = 3,
	ELevelExperienceRampType__DinoMedium = 4,
	ELevelExperienceRampType__MAX  = 5
};


// Enum ShooterGame.PrimalGameData.ELevelExperienceRampType
enum class ELevelExperienceRampType : uint8_t
{
	ELevelExperienceRampType__Player = 0,
	ELevelExperienceRampType__DinoMedium = 1,
	ELevelExperienceRampType__MAX  = 2,
	EAxis__None                    = 3,
	EAxis__Y                       = 4,
	EAxis__EAxis_MAX               = 5
};


// Enum ShooterGame.PrimalGameData.EPrimalItemType
enum class EPrimalItemType : uint8_t
{
	EPrimalItemType__MiscConsumable = 0,
	EPrimalItemType__Weapon        = 1,
	EPrimalItemType__Structure     = 2,
	EPrimalItemType__Skin          = 3,
	EPrimalItemType__Artifact      = 4,
	EPrimalItemType__EPrimalItemType_MAX = 5
};


// Enum ShooterGame.PrimalGameData.EPrimalItemStat
enum class EPrimalItemStat : uint8_t
{
	EPrimalItemStat__GenericQuality = 0,
	EPrimalItemStat__MaxDurability = 1,
	EPrimalItemStat__WeaponClipAmmo = 2,
	EPrimalItemStat__Weight        = 3,
	EPrimalItemStat__MAX           = 4,
	PSPT_None                      = 5,
	PSPT_ScalarRand                = 6,
	PSPT_VectorRand                = 7,
	PSPT_Actor                     = 8,
	PSPT_MAX                       = 9
};


// Enum ShooterGame.PrimalGameData.EDinoTamedOrder
enum class EDinoTamedOrder : uint8_t
{
	EDinoTamedOrder__SetAggressionPassive = 0,
	EDinoTamedOrder__SetAggressionAggressive = 1,
	EDinoTamedOrder__ToggleFollowMe = 2,
	EDinoTamedOrder__StopFollowing = 3,
	EDinoTamedOrder__MAX           = 4
};


// Enum ShooterGame.PrimalGameData.EXPType
enum class EXPType : uint8_t
{
	EXPType__XP_GENERIC            = 0,
	EXPType__XP_HARVEST            = 1,
	EXPType__XP_SPECIAL            = 2,
	EXPType__EXPType_MAX           = 3,
	IntProperty                    = 4
};


// Enum ShooterGame.PrimalGameData.ETribeGroupPermission
enum class ETribeGroupPermission : uint8_t
{
	ETribeGroupPermission__STRUCTUREACTIVATE = 0,
	ETribeGroupPermission__PET_ORDER = 1,
	ETribeGroupPermission__GENERAL_STRUCTUREDEMOLISH = 2,
	ETribeGroupPermission__GENERAL_BUILDSTRUCTUREINRANGE = 3,
	ETribeGroupPermission__PROMOTEMEMBER = 4,
	ETribeGroupPermission__BANISHMEMBER = 5,
	ETribeGroupPermission__ETribeGroupPermission_MAX = 6,
	MATUSAGE_SkeletalMesh          = 7,
	MATUSAGE_BeamTrails            = 8,
	MATUSAGE_StaticLighting        = 9,
	MATUSAGE_SplineMesh            = 10,
	MATUSAGE_InstancedStaticMeshes = 11,
	MATUSAGE_UI                    = 12
};


// Enum ShooterGame.PrimalGameData.EBoneModifierType
enum class EBoneModifierType : uint8_t
{
	EBoneModifierType__HEAD        = 0,
	EBoneModifierType__NECKLENGTH  = 1,
	EBoneModifierType__SHOULDERS   = 2,
	EBoneModifierType__UPPERARM    = 3,
	EBoneModifierType__HAND        = 4,
	EBoneModifierType__UPPERLEG    = 5,
	EBoneModifierType__FOOT        = 6,
	EBoneModifierType__TORSO       = 7,
	EBoneModifierType__LOWERFACESIZE = 8,
	EBoneModifierType__HEADHEIGHT  = 9,
	EBoneModifierType__HEADDEPTH   = 10,
	EBoneModifierType__MAX         = 11
};


// Enum ShooterGame.PrimalInventoryComponent.EPrimalItemMessage
enum class EPrimalItemMessage : uint8_t
{
	EPrimalItemMessage__Broken     = 0,
	EPrimalItemMessage__MAX        = 1,
	ESearchCase__CaseSensitive     = 2,
	ESearchCase__ESearchCase_MAX   = 3
};


// Enum ShooterGame.ShooterPlayerController.ESoTFDamageType
enum class ESoTFDamageType : uint8_t
{
	PVP                            = 0,
	DEATH                          = 1,
	EControllerAnalogStick__CAS_LeftStick = 2,
	EControllerAnalogStick__CAS_MAX = 3
};


// Enum ShooterGame.PrimalDinoCharacter.EBabyCuddleType
enum class EBabyCuddleType : uint8_t
{
	EBabyCuddleType__PET           = 0,
	EBabyCuddleType__WALK          = 1,
	EBabyCuddleType__EBabyCuddleType_MAX = 2,
	VTBlend_Linear                 = 3,
	VTBlend_EaseIn                 = 4
};


// Enum ShooterGame.PrimalStructureElevatorPlatform.EPrimalStructureElevatorState
enum class EPrimalStructureElevatorState : uint8_t
{
	PSLS_Down                      = 0,
	PSLS_MAX                       = 1,
	EEnvQueryTestClamping__None    = 2
};


// Enum ShooterGame.VictoryCore.EServerOctreeGroup
enum class EServerOctreeGroup : uint8_t
{
	EServerOctreeGroup__STASISCOMPONENTS = 0,
	EServerOctreeGroup__DINOPAWNS  = 1,
	EServerOctreeGroup__STRUCTURES = 2,
	EServerOctreeGroup__SPATIALNETWORKEDACTORS = 3,
	EServerOctreeGroup__ALL_SPATIAL = 4,
	EServerOctreeGroup__STRUCTURES_CORE = 5,
	EServerOctreeGroup__PLAYERS_AND_TAMED_DINOS = 6,
	EServerOctreeGroup__GRENADES   = 7,
	EServerOctreeGroup__EServerOctreeGroup_MAX = 8
};


// Enum ShooterGame.DataListEntryButton_PrimalFolder.FolderWidgetType
enum class EFolderWidgetType : uint8_t
{
	FolderWidgetType__FWT_Back     = 0,
	FolderWidgetType__FWT_CustomFolder = 1,
	TA_Wrap                        = 2,
	TA_Mirror                      = 3
};


// Enum ShooterGame.PrimalStructurePlacer.EPrimalStructurePlacerState
enum class EPrimalStructurePlacerState : uint8_t
{
	EPrimalStructurePlacerState__Default = 0,
	EPrimalStructurePlacerState__PlacingStructure = 1
};


// Enum ShooterGame.PrimalStructureItemContainer_CropPlot.ESeedCropPhase
enum class ESeedCropPhase : uint8_t
{
	ESeedCropPhase__Seedling       = 0,
	ESeedCropPhase__Growthling     = 1,
	ESeedCropPhase__MAX            = 2
};


// Enum ShooterGame.UI_Inventory.EDropItemIconAction
enum class EDropItemIconAction : uint8_t
{
	EDropItemIconAction__DA_NoAction = 0,
	EDropItemIconAction__DA_UnEquip = 1,
	EDropItemIconAction__DA_RemoveFromSlot = 2,
	EDropItemIconAction__DA_FromRemoteInv = 3,
	EDropItemIconAction__DA_MergeItemStack = 4,
	EDropItemIconAction__DA_SwapItems = 5,
	EDropItemIconAction__DA_UnEquipTransferToLocal = 6,
	EDropItemIconAction__DA_SplitItemStackOne = 7,
	EDropItemIconAction__DA_FromRemoteInvToSlot = 8,
	EDropItemIconAction__DA_EquipLocalFromRemote = 9,
	EDropItemIconAction__DA_UnequipTransferToRemote = 10,
	EDropItemIconAction__DA_FromArkInv = 11,
	EDropItemIconAction__MAX       = 12
};



//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ShooterGame.PrimalGameData.PrimalCharacterStatusValueDefinition
// 0x0020
struct FPrimalCharacterStatusValueDefinition
{
	class UTexture2D*                                  StatusValueIcon;                                          // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     StatusValueName;                                          // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               bLevelUpSetToMaxValue;                                    // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayHideCurrentValue;                                 // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayAsPercent;                                        // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1F];                                      // 0x0001(0x001F) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalCharacterStatusStateDefinition
// 0x0050
struct FPrimalCharacterStatusStateDefinition
{
	TEnumAsByte<EPrimalCharacterStatusValue>           StatusValueType;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                StatusValueThresholdIndex;                                // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  StatusStateIcon;                                          // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     StatusStateName;                                          // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FString                                     StatusStateDescription;                                   // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      StatusStateNameColor;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUsed;                                                    // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayHUDMessage;                                       // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     HUDMessage;                                               // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      HUDMessageColor;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4C];                                      // 0x0004(0x004C) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemStatDefinition
// 0x0018
struct FPrimalItemStatDefinition
{
	class UTexture2D*                                  ItemStatIcon;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     ItemStatName;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemDefinition
// 0x0018
struct FPrimalItemDefinition
{
	class UTexture2D*                                  ItemTypeIcon;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     ItemTypeName;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalEquipmentDefinition
// 0x0018
struct FPrimalEquipmentDefinition
{
	class UTexture2D*                                  EquipmentTypeIcon;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     EquipmentTypeName;                                        // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.PrimalItemQuality
// 0x0030
struct FPrimalItemQuality
{
	struct FLinearColor                                QualityColor;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     QualityName;                                              // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              QualityRandomMultiplierThreshold;                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CraftingXPMultiplier;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RepairingXPMultiplier;                                    // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CraftingResourceRequirementsMultiplier;                   // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2C];                                      // 0x0004(0x002C) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.StatusValueModifierDescription
// 0x0048
struct FStatusValueModifierDescription
{
	class UTexture2D*                                  ModifierIcon;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     ModifierName;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FString                                     ModifierDescription;                                      // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      ModifierColor;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDisplayHUDMessage;                                       // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     HUDMessage;                                               // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FColor                                      HUDMessageColor;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x44];                                      // 0x0004(0x0044) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.AppIDItem
// 0x0020
struct FAppIDItem
{
	int                                                AppID;                                                    // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                PlayerBadgeGroup;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             PlayerIDStrings;                                          // 0x0000(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      ItemClass;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.TutorialDefinition
// 0x0030
struct FTutorialDefinition
{
	struct FString                                     TutorialTitle;                                            // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FString                                     TutorialText;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UTexture2D*                                  TutorialImage;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TutorialDuration;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NextTutorialIndex;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2C];                                      // 0x0004(0x002C) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.ColorDefinition
// 0x0018
struct FColorDefinition
{
	struct FName                                       ColorName;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                ColorValue;                                               // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.BoneModifierRange
// 0x003C
struct FBoneModifierRange
{
	struct FName                                       BoneName;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MinScale;                                                 // 0x0000(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MaxScale;                                                 // 0x0000(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MinTranslation;                                           // 0x0000(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     MaxTranslation;                                           // 0x0000(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               Recursive;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3B];                                      // 0x0001(0x003B) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.BoneModifierRangeArray
// 0x0020
struct FBoneModifierRangeArray
{
	unsigned char                                      bAffectsLegLength : 1;                                    // 0x0000(0x0001) (Edit)
	unsigned char                                      bUseExtraMax : 1;                                         // 0x0000(0x0001) (Edit)
	float                                              MinLegLengthMultiplier;                                   // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxLegLengthMultiplier;                                   // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FBoneModifierRange>                  BoneArray;                                                // 0x0000(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0010(0x0010) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.PlayerCharacterGenderDefinition
// 0x05E0
struct FPlayerCharacterGenderDefinition
{
	struct FString                                     GenderString;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                      CharacterBlueprint;                                       // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FLinearColor>                        ColorSetBody;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                        ColorSetHair;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                        ColorSetEyes;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                          CharacterPreviewMaterial;                                 // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FString>                             DefaultCharacterNames;                                    // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FBoneModifierRangeArray                     CharacterBoneModifierRanges[0x16];                        // 0x0000(0x0020) (Edit, DisableEditOnInstance)
	struct FBoneModifierRangeArray                     ExtraCharacterBoneModifierMax[0x16];                      // 0x0000(0x0020) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x320];                                     // 0x02C0(0x0320) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.LevelExperienceRamp
// 0x0010
struct FLevelExperienceRamp
{
	TArray<float>                                      ExperiencePointsForLevel;                                 // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct ShooterGame.PrimalGameData.NamedTeamDefinition
// 0x0080
struct FNamedTeamDefinition
{
	struct FName                                       TeamName;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bTargetingTeamExclusionList : 1;                          // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bTargetingTeamInclusionList : 1;                          // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowTargetsOnOwnTeam : 1;                               // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIsCarnivore : 1;                                         // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bTargetPlayersAndTamedOnly : 1;                           // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bForceTargetPlayersAndTamed : 1;                          // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bIgnoredByAllTeams : 1;                                   // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	TArray<struct FName>                               TeamNameList;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               TargetingMultiplierTeamNames;                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               DontGiveDamageTeamList;                                   // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               DontReceiveDamageTeamList;                                // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FName>                               MaximumTargetableDistanceTeams;                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      MaximumTargetableDistances;                               // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      TargetingMultiplierTeamWeights;                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x70];                                      // 0x0010(0x0070) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.ClassRemapping
// 0x0010
struct FClassRemapping
{
	class UClass*                                      FromClass;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ToClass;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.ClassAddition
// 0x0018
struct FClassAddition
{
	class UClass*                                      ForClass;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              ClassAdditions;                                           // 0x0000(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.RandValueRange
// 0x000C
struct FRandValueRange
{
	float                                              MinVal;                                                   // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxVal;                                                   // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RandPower;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0004(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.DinoBabySetup
// 0x0038
struct FDinoBabySetup
{
	struct FName                                       DinoNameTag;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FBoneModifierRangeArray>             BabyBoneModifierRanges;                                   // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      WildRandomScaleRangeWeights;                              // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FRandValueRange>                     WildRandomScaleRanges;                                    // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0010(0x0028) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.MultiAchievement
// 0x0020
struct FMultiAchievement
{
	struct FString                                     UnlockAchievement;                                        // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FString>                             RequiredAchievements;                                     // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0010(0x0010) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.ClassRemappingWeight
// 0x0028
struct FClassRemappingWeight
{
	class UClass*                                      FromClass;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              ToClasses;                                                // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<float>                                      Weights;                                                  // 0x0000(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0010(0x0018) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.NPCDifficultyLevelRange
// 0x0030
struct FNPCDifficultyLevelRange
{
	TArray<float>                                      EnemyLevelsMin;                                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<float>                                      EnemyLevelsMax;                                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<float>                                      GameDifficulties;                                         // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0010(0x0020) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.NPCSpawnEntry
// 0x00F0
struct FNPCSpawnEntry
{
	struct FString                                     AnEntryName;                                              // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              NPCsToSpawn;                                              // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FClassRemappingWeight>               NPCRandomSpawnClassWeights;                               // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                             NPCsSpawnOffsets;                                         // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCsToSpawnPercentageChance;                              // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMinLevelOffset;                                        // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMaxLevelOffset;                                        // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMinLevelMultiplier;                                    // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      NPCMaxLevelMultiplier;                                    // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      bAddLevelOffsetBeforeMultiplier : 1;                      // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	TArray<unsigned char>                              NPCOverrideLevel;                                         // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                     ExtentCheck;                                              // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     GroupSpawnOffset;                                         // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              EntryWeight;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ManualSpawnPointSpreadRadius;                             // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WaterOnlySpawnMinimumWaterHeight;                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaximumWaterHeight;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FNPCDifficultyLevelRange>            NPCDifficultyLevelRanges;                                 // 0x0000(0x0010) (Edit, ZeroConstructor)
	float                                              LevelDifficultyTestOverride;                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnMinDistanceFromStructuresMultiplier;                 // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnMinDistanceFromPlayersMultiplier;                    // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnMinDistanceFromTamedDinosMultiplier;                 // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xEC];                                      // 0x0004(0x00EC) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.NPCSpawnLimit
// 0x0010
struct FNPCSpawnLimit
{
	class UClass*                                      NPCClass;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPercentageOfDesiredNumToAllow;                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.NPCSpawnEntriesContainerAdditions
// 0x0028
struct FNPCSpawnEntriesContainerAdditions
{
	class UClass*                                      SpawnEntriesContainerClass;                               // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FNPCSpawnEntry>                      AdditionalNPCSpawnEntries;                                // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FNPCSpawnLimit>                      AdditionalNPCSpawnLimits;                                 // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0010(0x0018) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.ItemAttachmentInfo
// 0x0028
struct FItemAttachmentInfo
{
	class UActorComponent*                             ComponentToAttach;                                        // 0x0000(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	struct FName                                       SocketToAttachTo;                                         // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bCanBuildStructuresOn : 1;                                // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAttachmentRequireWeaponSupportShield : 1;                // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseParentAnims : 1;                                      // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAttachToFirstPersonHands : 1;                            // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAttachToThirdPersonWeaponMesh : 1;                       // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDisabled : 1;                                            // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseItemColors : 1;                                       // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseIgnoreAttachmentWhenEquipmentOfType : 1;              // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bHideCharacterMesh : 1;                                   // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	TEnumAsByte<EPrimalEquipmentType>                  IgnoreAttachmentWhenEquipmentOfType;                      // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AttachedCompName;                                         // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TWeakObjectPtr<class UActorComponent>              AttachedCompReference;                                    // 0x0000(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalItem.ActorClassAttachmentInfo
// 0x0050
struct FActorClassAttachmentInfo
{
	class UClass*                                      OwnerActorClassParent;                                    // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FItemAttachmentInfo>                 ItemAttachmentInfos;                                      // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FName                                       PlayerMeshTextureMaskParamName;                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  PlayerMeshTextureMask;                                    // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  PlayerMeshNoItemDefaultTextureMask;                       // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                PlayerMeshTextureMaskMaterialIndex;                       // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       FPVHandsMeshTextureMaskParamName;                         // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture2D*                                  FPVHandsMeshTextureMask;                                  // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                FPVHandsMeshTextureMaskMaterialIndex;                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4C];                                      // 0x0004(0x004C) MISSED OFFSET
};

// ScriptStruct ShooterGame.ItemNetID
// 0x0008
struct FItemNetID
{
	uint32_t                                           ItemID1;                                                  // 0x0000(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	uint32_t                                           ItemID2;                                                  // 0x0000(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalGameData.CraftingResourceRequirement
// 0x0018
struct FCraftingResourceRequirement
{
	float                                              BaseResourceRequirement;                                  // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ResourceItemType;                                         // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bCraftingRequireExactResourceType;                        // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0001(0x0017) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalItem.UseItemAddCharacterStatusValue
// 0x001C
struct FUseItemAddCharacterStatusValue
{
	float                                              BaseAmountToAdd;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bPercentOfMaxStatusValue : 1;                             // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bSetAdditionalValue : 1;                                  // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPercentOfCurrentStatusValue : 1;                         // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bResetExistingModifierDescriptionIndex : 1;               // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bUseItemQuality : 1;                                      // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDontRequireLessThanMaxToUse : 1;                         // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAddOverTime : 1;                                         // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAddOverTimeSpeedInSeconds : 1;                           // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bContinueOnUnchangedValue : 1;                            // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bSetValue : 1;                                            // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	float                                              LimitExistingModifierDescriptionToMaxAmount;              // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AddOverTimeSpeed;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                StatusValueModifierDescriptionIndex;                      // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ItemQualityAddValueMultiplier;                            // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EPrimalCharacterStatusValue>           StatusValueType;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EPrimalCharacterStatusValue>           StopAtValueNearMax;                                       // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1B];                                      // 0x0001(0x001B) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalItem.ItemStatInfo
// 0x0020
struct FItemStatInfo
{
	unsigned char                                      bUsed : 1;                                                // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCalculateAsPercent : 1;                                  // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bDisplayAsPercent : 1;                                    // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bRequiresSubmerged : 1;                                   // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bPreventIfSubmerged : 1;                                  // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	int                                                DefaultModifierValue;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                RandomizerRangeOverride;                                  // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RandomizerRangeMultiplier;                                // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TheRandomizerPower;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData)
	float                                              StateModifierScale;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InitialValueConstant;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RatingValueMultiplier;                                    // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0004(0x001C) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalItem.CropItemPhaseData
// 0x00D0
struct FCropItemPhaseData
{
	float                                              NextStageFertilizerCacheThreshold;                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UStaticMesh*                                 StageStaticMesh;                                          // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UStaticMesh*>                         StageStaticMeshes;                                        // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class UStaticMesh*                                 HasFruitStageStaticMesh;                                  // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UStaticMesh*>                         HasFruitStageStaticMeshes;                                // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                     StageStaticMeshScale3D;                                   // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     StageStaticMeshTranslationOffset;                         // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    StageStaticMeshRotationOffset;                            // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FVector>                             StageStaticMeshScales3D;                                  // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FVector>                             StageStaticMeshTranslationOffsets;                        // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FRotator>                            StageStaticMeshRotationOffsets;                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              StageReachedItemsToGive;                                  // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                      StageReachedItemsToGiveWeights;                           // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      StageBlockCollisions;                                     // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseStageStructure;                                       // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      StageStructure;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     StageStructureOffset;                                     // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC4];                                      // 0x000C(0x00C4) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalItem.SaddlePassengerSeatDefinition
// 0x0070
struct FSaddlePassengerSeatDefinition
{
	struct FName                                       AttachBoneName;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FString                                     BoardActionText;                                          // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                     UnboardLocationOffset;                                    // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     FPVCameraLocationOffset;                                  // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     AttachRelativeLocation;                                   // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    AttachRelativeRotation;                                   // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CharacterAdditiveAnim;                                    // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bHideCharacterLowerBody : 1;                              // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bLimitCameraYaw : 1;                                      // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bWeaponIgnoreDino : 1;                                    // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bHideDinoForLocalPassenger : 1;                           // 0x0000(0x0001) (Edit, DisableEditOnInstance)
	float                                              CameraYawRange;                                           // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffsetYawFactor;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffsetPitchFactor;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffsetYawBias;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffsetPitchBias;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ExtraHypoThermalInsulation;                               // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ExtraHyperThermalInsulation;                              // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6C];                                      // 0x0004(0x006C) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalItem.ItemCraftQueueEntry
// 0x0010
struct FItemCraftQueueEntry
{
	struct FItemNetID                                  ItemId;                                                   // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                Quantity;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsRepair;                                                // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0001(0x000F) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalInventoryComponent.ItemMultiplier
// 0x0010
struct FItemMultiplier
{
	class UClass*                                      ItemClass;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ItemMultiplier;                                           // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalInventoryComponent.ItemSpawnActorClassOverride
// 0x0010
struct FItemSpawnActorClassOverride
{
	class UClass*                                      ItemClass;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      ActorClassOverride;                                       // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct ShooterGame.PrimalInventoryComponent.ItemCraftingConsumptionReplenishment
// 0x0018
struct FItemCraftingConsumptionReplenishment
{
	TArray<class UClass*>                              ItemResourceClasses;                                      // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
