#pragma once

// Name: ARKSotF, Version: 178.8.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class ShooterGame.AnimNotify_CustomEvent
// 0x0010 (0x0040 - 0x0030)
class UAnimNotify_CustomEvent : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.AnimNotify_CustomEvent");
		return ptr;
	}

};


// Class ShooterGame.AnimNotify_StopSound
// 0x0010 (0x0040 - 0x0030)
class UAnimNotify_StopSound : public UAnimNotify
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.AnimNotify_StopSound");
		return ptr;
	}

};


// Class ShooterGame.AnimNotifyState_Custom
// 0x0010 (0x0038 - 0x0028)
class UAnimNotifyState_Custom : public UAnimNotifyState
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.AnimNotifyState_Custom");
		return ptr;
	}

};


// Class ShooterGame.BasePlayerController
// 0x0028 (0x07C8 - 0x07A0)
class ABasePlayerController : public APlayerController
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x07A0(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.BasePlayerController");
		return ptr;
	}


	void SimulateInputKey(const struct FKey& Key, bool bPressed);
	void ServerCheat(const struct FString& Msg);
	void Say(const struct FString& Msg);
	void ClientStartOnlineGame();
	void ClientSetSpectatorCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation);
	void ClientSendRoundEndEvent(bool bIsWinner, int ExpendedTimeInSeconds);
	void ClientGameStarted();
	void ClientEndOnlineGame();
};


// Class ShooterGame.PrimalGlobals
// 0x0140 (0x0168 - 0x0028)
class UPrimalGlobals : public UObject
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x0028(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalGlobals");
		return ptr;
	}


	void OnConfirmationDialogClosed(bool bAccept);
	class ADayCycleManager* GetDayCycleManager(class UWorld* World);
	void FinishedLoadingGameMedia();
};


// Class ShooterGame.DataListProviderInterface
// 0x0000 (0x0028 - 0x0028)
class UDataListProviderInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListProviderInterface");
		return ptr;
	}

};


// Class ShooterGame.PrimalGameData
// 0x1AB0 (0x1AD8 - 0x0028)
class UPrimalGameData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1AB0];                                    // 0x0028(0x1AB0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalGameData");
		return ptr;
	}

};


// Class ShooterGame.DataListEntryInterface
// 0x0000 (0x0028 - 0x0028)
class UDataListEntryInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListEntryInterface");
		return ptr;
	}

};


// Class ShooterGame.PrimalItem
// 0x0788 (0x07B0 - 0x0028)
class UPrimalItem : public UObject
{
public:
	unsigned char                                      UnknownData00[0x788];                                     // 0x0028(0x0788) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalItem");
		return ptr;
	}


	struct FLinearColor StaticGetColorForItemColorID(int ID);
	bool IsCooldownReadyForUse();
	bool IsActiveEquipped();
	int IncrementItemQuantity(int amount, bool bRepicateToClient, bool bDontUpdateWeight, bool bIsFromUseConsumption, bool bIsArkTributeItem, bool bIsFromCraftingConsumption);
	void EquippedBlueprintTick(float DeltaSeconds);
	void BPUsedOntoItem(class UPrimalItem* DestinationItem, int AdditionalData);
	bool BPSupportUseOntoItem(class UPrimalItem* DestinationItem);
	class UParticleSystem* BPGetFuelParticleSystemOverride(class APrimalStructure* ForStructure);
	class USoundBase* BPGetFuelAudioOverride(class APrimalStructure* ForStructure);
	bool BPCanUse(bool bIgnoreCooldown);
	bool BPCanAddToInventory(class UPrimalInventoryComponent* toInventory);
	struct FString BPAllowCrafting(class AShooterPlayerController* ForPC);
	void BlueprintUsed();
	void BlueprintUnequipped();
	void BlueprintEquipped(bool bIsFromSaveGame);
	class UPrimalItem* AddNewItem(class UClass* ItemArchetype, class UPrimalInventoryComponent* GiveToInventory, bool bEquipItem, bool bDontStack, float ItemQuality, bool bForceNoBlueprint, int quantityOverride, bool bForceBlueprint);
	void AddItemDurability(float durabilityToAdd);
};


// Class ShooterGame.ShooterHUD
// 0x0528 (0x0A38 - 0x0510)
class AShooterHUD : public AHUD
{
public:
	unsigned char                                      UnknownData00[0x528];                                     // 0x0510(0x0528) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.ShooterHUD");
		return ptr;
	}


	class APlayerController* GetPlayerOwner();
};


// Class ShooterGame.PrimalInventoryComponent
// 0x0358 (0x0460 - 0x0108)
class UPrimalInventoryComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x358];                                     // 0x0108(0x0358) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalInventoryComponent");
		return ptr;
	}


	void UpdateTribeGroupInventoryRank(unsigned char NewRank);
	void StaticDropNewItem(class AActor* forActor, class UClass* AnItemClass, float ItemQuality, bool bForceNoBlueprint, int quantityOverride, bool bForceBlueprint, class UClass* TheDroppedTemplateOverride, const struct FRotator& DroppedRotationOffset, bool bOverrideSpawnTransform, const struct FVector& LocationOverride, const struct FRotator& RotationOverride, bool bPreventDropImpulse, bool bThrow, bool bSecondaryAction, bool bSetItemDropLocation);
	void SetNextItemSpoilingID(const struct FItemNetID& NextItemID);
	void SetNextItemConsumptionID(const struct FItemNetID& NextItemID);
	void SetCraftingEnabled(bool bEnable);
	void ServerSplitItemStack(const struct FItemNetID& ItemId, int AmountToSplit);
	void ServerRemoveItemFromSlot(const struct FItemNetID& ItemId);
	void ServerMergeItemStack(const struct FItemNetID& ItemId);
	void ServerMakeRecipeItem(class APrimalStructureItemContainer* Container, const struct FItemNetID& NoteToConsume, class UClass* RecipeItemTemplate, const struct FString& CustomName, const struct FString& CustomDescription, TArray<struct FColor> CustomColors, TArray<struct FCraftingResourceRequirement> CustomRequirements);
	void ServerForceMergeItemStack(const struct FItemNetID& Item1ID, const struct FItemNetID& Item2ID);
	void ServerCraftItem(class AShooterPlayerController* ByPC, struct FItemNetID* ItemId);
	void ServerAddItemToSlot(const struct FItemNetID& ItemId, int SlotIndex);
	bool RemoveItem(bool bDoDrop, bool bSecondryAction, bool bForceRemoval, struct FItemNetID* ItemId);
	bool RemoteInventoryAllowViewing(class AShooterPlayerController* PC);
	bool RemoteInventoryAllowRepairingItems(class AShooterPlayerController* PC, bool bIgnoreEnabled);
	bool RemoteInventoryAllowCraftingItems(class AShooterPlayerController* PC, bool bIgnoreEnabled);
	bool IsRepairingAllowed();
	bool IsLocal();
	bool IsCraftingAllowed(class UPrimalItem* anItem);
	float GetTotalEquippedItemStat(TEnumAsByte<EPrimalItemStat> statType);
	int GetMaxInventoryItems(bool bIgnoreHiddenDefaultInventory);
	int GetItemTemplateQuantity(class UClass* ItemTemplate, class UPrimalItem* IgnoreItem, bool bIgnoreBlueprints, bool bCheckValidForCrafting, bool bRequireExactClassMatch);
	class UPrimalItem* GetEquippedItemOfType(TEnumAsByte<EPrimalEquipmentType> aType);
	float GetEquippedArmorRating(TEnumAsByte<EPrimalEquipmentType> EquipmentType);
	bool GenerateCrateItems(float MinQualityMultiplier, float MaxQualityMultiplier);
	void ConsumeArmorDurability(float ConsumptionAmount, bool bAllArmorTypes, TEnumAsByte<EPrimalEquipmentType> SpecificArmorType);
	void ClientItemMessageNotification(const struct FItemNetID& ItemId, TEnumAsByte<EPrimalItemMessage> ItemMessageType);
	bool BPRemoteInventoryAllowRemoveItems(class AShooterPlayerController* PC, class UPrimalItem* anItemToTransfer);
	float BPOverrideItemMinimumUseInterval(class UPrimalItem* theItem);
	void BPNotifyItemRemoved(class UPrimalItem* anItem);
	void BPNotifyItemQuantityUpdated(class UPrimalItem* anItem, int amount);
	void BPNotifyItemAdded(class UPrimalItem* anItem, bool bEquipItem);
	void BPInventoryRefresh();
	int BPIncrementItemTemplateQuantity(class UClass* ItemTemplate, int amount, bool bReplicateToClient, bool bIsBlueprint, bool bRequireExactClassMatch, bool bIsCraftingResourceConsumption, bool bIsFromUseConsumption, bool bIsArkTributeItem);
	class UPrimalItem* BPGetItemOfTemplate(class UClass* ItemTemplate, bool bOnlyInventoryItems, bool bOnlyEquippedItems, bool IgnoreItemsWithFullQuantity, bool bFavorSlotItems, bool bIsBlueprint, bool bRequiresExactClassMatch, bool bIgnoreSlotItems, bool bOnlyArkItems, bool bPreferEngram, bool bIsForCraftingConsumption);
	void BPDropInventoryDeposit(double DestroyAtTime);
	void BPCraftingFinishedNotification(class UPrimalItem* itemToBeCrafted);
	bool BPAllowUseInInventory(class UPrimalItem* theItem, bool bIsRemoteInventory, class AShooterPlayerController* ByPC);
	void BPAccessedInventory(class AShooterPlayerController* ForPC);
};


// Class ShooterGame.FogOfWar
// 0x0060 (0x0088 - 0x0028)
class UFogOfWar : public UObject
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0028(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.FogOfWar");
		return ptr;
	}

};


// Class ShooterGame.PrimalLocalProfile
// 0x0118 (0x0140 - 0x0028)
class UPrimalLocalProfile : public UObject
{
public:
	unsigned char                                      UnknownData00[0x118];                                     // 0x0028(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalLocalProfile");
		return ptr;
	}

};


// Class ShooterGame.PrimalPlayerData
// 0x01C8 (0x01F0 - 0x0028)
class UPrimalPlayerData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1C8];                                     // 0x0028(0x01C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalPlayerData");
		return ptr;
	}


	struct FString LinkedPlayerIDString();
	struct FString GetUniqueIdString();
	class AShooterCharacter* FindCharacterForPlayer(class UWorld* inWorld);
};


// Class ShooterGame.ShooterPlayerController
// 0x05E0 (0x0DA8 - 0x07C8)
class AShooterPlayerController : public ABasePlayerController
{
public:
	unsigned char                                      UnknownData00[0x5E0];                                     // 0x07C8(0x05E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.ShooterPlayerController");
		return ptr;
	}


	void TestPhysxPerf();
	void TestNotification();
	void TestAlarmNotification(const struct FString& Title, const struct FString& Message);
	void TeleportSpectatorToPlayerCharacter(class AShooterCharacter* ToPlayerCharacter);
	void StopSpectating();
	void ShowTribeManager();
	void ShowMyAdminManager();
	void SetCheatPlayer(bool bEnable);
	void SetAdminIcon(bool bAdminIcon);
	void ServerUploadDino(class APrimalDinoCharacter* DownloadedDino);
	void ServerUploadCharaterDataToArk(class UPrimalInventoryComponent* InventoryComp);
	void ServerUnbanPlayer(const struct FString& PlayerSteamName, const struct FString& PlayerSteamID);
	void ServerTransferToRemoteInventory(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId, bool bAlsoTryToEqup, int requestedQuantity);
	void ServerTransferFromRemoteInventory(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId, int requestedQuantity, int ToSlotIndex, bool bEquipItem);
	void ServerTransferAllToRemoteInventory(class UPrimalInventoryComponent* InventoryComp, const struct FString& CurrentCustomFolderFilter, const struct FString& CurrentNameFilter);
	void ServerTransferAllFromRemoteInventory(class UPrimalInventoryComponent* InventoryComp, const struct FString& CurrentCustomFolderFilter, const struct FString& CurrentNameFilter);
	void ServerSuicide();
	void ServerStopSpectating();
	void ServerStayAlive();
	void ServerSpectateToPlayerByID(uint64_t PlayerId);
	void ServerSpectateLastDeathLocation();
	void ServerShowMessageOfTheDay();
	void ServerSetVRPlayer(bool bSetVRPlayer);
	void ServerSetSupressAdminIcon(bool bSuppress);
	void ServerSetSubscribedApp(int AppID);
	void ServerSetSpectatorFirstPersonViewTarget(class AActor* InTarget);
	void ServerSetMessageOfTheDay(const struct FString& Message);
	void ServerSetDamageLogOpen(bool bIsOpen);
	void ServerSetAutoJoinTribe(const struct FSOTFPartyInfo& PartyInfo);
	void ServerSendDirectMessage(const struct FString& PlayerSteamID, const struct FString& Message);
	void ServerSendChatMessage(const struct FString& ChatMessage, int SendMode);
	void ServerSendArkDataPayloadEnd(const struct FGuid& ID, TEnumAsByte<EPrimalARKTributeDataType> ArkDataType);
	void ServerSendArkDataPayloadBegin(const struct FGuid& ID, TEnumAsByte<EPrimalARKTributeDataType> ArkDataType, const struct FString& DataClass, const struct FString& TagName, const struct FString& Name, TArray<struct FString> DataStats, uint32_t ID1, uint32_t ID2);
	void ServerSendArkDataPayload(const struct FGuid& ID, TEnumAsByte<EPrimalARKTributeDataType> ArkDataType, TArray<unsigned char> DataBytes);
	void ServerSaveWorld();
	void ServerRequestTribeLog();
	void ServerRequestSetPin(class UObject* forTarget, int PinValue, bool bIsSetting);
	void ServerRequestRespawnAtPoint(int spawnPointID, int spawnRegionIndex);
	void ServerRequestRemoveWeaponClipAmmo(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerRequestRemoveItemSkin(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerRequestRemoteDropAllItems(class UPrimalInventoryComponent* InventoryComp, const struct FString& CurrentCustomFolderFilter, const struct FString& CurrentNameFilter);
	void ServerRequestPlaceStructure(int StructureIndex, const struct FVector& BuildLocation, const struct FRotator& BuildRotation, const struct FRotator& PlayerViewRotation, class APawn* AttachToPawn, class APrimalDinoCharacter* DinoCharacter, const struct FName& BoneName, const struct FItemNetID& PlaceUsingItemID, bool bSnapped, bool bIsCheat, bool bIsFlipped);
	void ServerRequestLevelUp(class UPrimalCharacterStatusComponent* forStatusComp, TEnumAsByte<EPrimalCharacterStatusValue> ValueType);
	void ServerRequestInventoryUseItemWithItem(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemID1, const struct FItemNetID& ItemID2, int AdditionalData);
	void ServerRequestInventoryUseItemWithActor(class AActor* anActor, class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemID1, int AdditionalData);
	void ServerRequestInventoryUseItem(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId, bool bEntireStack);
	void ServerRequestInventorySwapItems(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemID1, const struct FItemNetID& ItemID2);
	void ServerRequestFastTravelToPoint(int fromSpawnPointID, int spawnPointID);
	void ServerRequestDropAllItems(const struct FString& CurrentCustomFolderFilter, const struct FString& CurrentNameFilter);
	void ServerRequestCreateNewPlayerWithArkData(TArray<unsigned char> PlayerArkDataBytes);
	void ServerRequestActorItems(class UPrimalInventoryComponent* forInventory, bool bInventoryItems, bool bIsFirstSpawn);
	void ServerRepeatMultiUse(class UObject* ForObject, int UseIndex);
	void ServerRepairItem(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerRemoveSteamItemSucceeded();
	void ServerRemoveSteamItem(uint32_t ItemdDefId);
	void ServerRemovePawnItem(const struct FItemNetID& ItemId, bool bSecondryAction);
	void ServerRemovePassenger();
	void ServerRemoveAllSteamInventory();
	void ServerReleaseSeatingStructure();
	void ServerRefreshSteamInventory();
	void ServerRefreshCosmeticsSteamInventory();
	void ServerReadMessageOFTheDay();
	void ServerPaint(class UStructurePaintingComponent* Structure, TArray<struct FPaintItem> Paints, bool bLastBatch, bool bFromLoadFile, bool ReplicateToClients);
	void ServerNotifyEditText(const struct FString& TextToUse, bool checkedBox, class UClass* ForObjectClass, uint32_t ExtraID1, uint32_t ExtraID2, class UObject* ForObject);
	void ServerMultiUse(class UObject* ForObject, int UseIndex);
	void ServerLoadWorld();
	void ServerLoadArkInventoryItems(TArray<struct FItemNetInfo> ArkInventoryItems);
	void ServerListPlayers();
	void ServerKickPlayer(const struct FString& PlayerSteamName, const struct FString& PlayerSteamID);
	void ServerInventoryClearCraftQueue(class UPrimalInventoryComponent* InventoryComp);
	void ServerGiveItem(int ArchIndex);
	void ServerGetMessageOfTheDay();
	void ServerGetCosmeticsItems(bool bSuccess);
	void ServerEquipToRemoteInventory(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerEquipPawnItem(const struct FItemNetID& ItemId);
	void ServerDropFromRemoteInventory(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerDisallowPlayerToJoinNoCheck(const struct FString& PlayerId);
	void ServerDeleteItemFromCustomFolder(class UPrimalInventoryComponent* forInventory, const struct FString& CFolderName, int InventoryCompType, const struct FItemNetID& ItemId);
	void ServerDeleteCustomFolder(class UPrimalInventoryComponent* forInventory, const struct FString& CFolderName, int InventoryCompType);
	void ServerCycleToClosestEnemies(bool bIsFirstPersonSpectating);
	void ServerCycleSpectator(bool bNext);
	void ServerCraftItem(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerCheckUnfreeze();
	void ServerBanPlayer(const struct FString& PlayerSteamName, const struct FString& PlayerSteamID);
	void ServerAutoCreateTribe(const struct FSOTFPartyInfo& PartyInfo);
	void ServerAllowPlayerToJoinNoCheck(const struct FString& PlayerId);
	void ServerAddItemToCustomFolder(class UPrimalInventoryComponent* forInventory, const struct FString& CFolderName, int InventoryCompType, const struct FItemNetID& ItemId);
	void ServerAddItemToArkInventory(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerAddItemFromArkInventory(class UPrimalInventoryComponent* InventoryComp, const struct FItemNetID& ItemId);
	void ServerActorViewRemoteInventory(class UPrimalInventoryComponent* InventoryComp);
	void ServerActorCloseRemoteInventory(class UPrimalInventoryComponent* InventoryComp);
	void ServerAcceptTribeInvite();
	void SendAlarmNotification(const struct FString& SteamID, const struct FString& Title, const struct FString& Message);
	bool SameLinkedId(int64_t Value);
	void RPCStayAlive();
	void ResetDodgePunishment();
	void RequestSpectator(const struct FString& InSpectatorPass);
	void RemoveItemSucceeded();
	void PrintColors();
	void OnToggleInGameMenu();
	void OnServerRefreshSteamInventoryForRemoveFinished(bool bSuccess, uint64_t SteamID);
	void OnServerRefreshSteamInventoryFinished(bool bSuccess, uint64_t SteamID);
	void OnServerRefreshCosmeticsSteamInventoryFinished(bool bSuccess, uint64_t SteamID);
	void OnRefreshSteamInventoryToCheckConsumeFinished(bool bSuccess, uint64_t SteamID);
	void OnRefreshSteamInventoryFinished(bool bSuccess, uint64_t SteamID);
	void OnEnableSpectator();
	void OnDisableSpectator();
	void OnConsumeItemFinished(bool bSuccess, uint64_t SteamID);
	void OnAddItemFinished(bool bSuccess, TArray<uint64_t> SteamItemUserIDs, uint64_t SteamID, uint32_t SteamDefID, uint32_t AppID);
	void NotifyTribeWarStatus(const struct FString& EnemyTribeString, int StatusType);
	struct FString LinkedPlayerIDString();
	bool IsSpectator();
	bool IsHudVisible();
	void InitCharacterPainting(class APrimalCharacter* Char);
	void HideRiders(bool bDoHide);
	bool GiveSlotItemNum(int masterIndexNum, int slotNum, int quantityOverride);
	bool GiveSlotItem(const struct FString& blueprintPath, int slotNum, int quantityOverride);
	void GiveColors(int Quantity);
	int GetTribeID();
	class AActor* GetSpectatorOrbitTarget();
	class AActor* GetSpectatorFirstPersonTarget();
	struct FString GetPlayerCharacterName();
	class AShooterCharacter* GetPlayerCharacter();
	int GetLinkedPlayerID();
	void ForfeitMatch(bool AFK);
	void Forfeit();
	void FlushLevelStreaming();
	void EnableSpectator();
	void DoServerCheckUnfreeze();
	void DoCrash();
	void DebugStructures();
	void ClientUsedActorItem(class UPrimalInventoryComponent* forInventory, const struct FItemNetID& ItemId);
	void ClientUploadDino(class APrimalDinoCharacter* DownloadedDino);
	void ClientUpdateItemQuantity(class UPrimalInventoryComponent* forInventory, const struct FItemNetID& ItemId, int ItemQuantity);
	void ClientUpdateItemDurability(class UPrimalInventoryComponent* forInventory, const struct FItemNetID& ItemId, float ItemDurability);
	void ClientUpdateInventoryCraftQueue(class UPrimalInventoryComponent* forInventory, TArray<struct FItemCraftQueueEntry> CraftQueueEntries);
	void ClientUpdateActorTransform(class AActor* forActor, const struct FVector& TheLocation, const struct FRotator& TheRotation, const struct FVector& TheVelocity);
	void ClientUnlockAchievement(const struct FString& AchievementID);
	void ClientTeleportSpectator(const struct FVector& Location, uint64_t PlayerId, bool bCanSpectateDeadPlayers, bool bSpectatingToLoc, const struct FVector& camDir, bool bForceDisableFirstPersonSpectator);
	void ClientSwapActorItems(class UPrimalInventoryComponent* forInventory, const struct FItemNetID& ItemID1, const struct FItemNetID& ItemID2);
	void ClientStopAFKCountDown();
	void ClientStartReceivingTribeLog();
	void ClientStartReceivingActorItems(class UPrimalInventoryComponent* forInventory, bool bEquippedItems);
	void ClientStartAFKCountDown(float CountDownTime);
	void ClientShowSpawnUI(float Delay);
	void ClientShowPaintingUI(class UObject* ObjectToPaint);
	void ClientShowCosmeticsRewardPopup(int SteamItemID);
	void ClientShowCharacterCreationUI();
	void ClientServerSOTFNotificationCustom(const struct FString& MessageText, const struct FLinearColor& MessageColor, float DisplayScale, float DisplayTime, class UTexture2D* MessageIcon, class USoundBase* SoundToPlay, bool bCanUseChatNotification);
	void ClientServerSOTFNotification(TEnumAsByte<ESTOFNotificationType> NotificationType, const struct FString& MessageText, const struct FLinearColor& MessageColor, float DisplayScale, float DisplayTime, class UTexture2D* MessageIcon, class USoundBase* SoundToPlay, bool bLastPlayer, const struct FString& TribeName, int TribeID, TArray<struct FString> PlayerNames, const struct FString& DeathReason, TArray<struct FPrimalPlayerCharacterConfigStructReplicated> DeadPlayersData, bool bCanUseChatNotification, bool bForceScreenMessage);
	void ClientServerNotificationSingle(const struct FString& MessageText, const struct FLinearColor& MessageColor, float DisplayScale, float DisplayTime, class UTexture2D* MessageIcon, class USoundBase* SoundToPlay, int MessageTypeID, bool bCanUseChatNotification);
	void ClientServerNotification(const struct FString& MessageText, const struct FLinearColor& MessageColor, float DisplayScale, float DisplayTime, class UTexture2D* MessageIcon, class USoundBase* SoundToPlay, bool bCanUseChatNotification);
	void ClientServerChatMessage(const struct FString& MessageText, const struct FLinearColor& MessageColor, bool bIsBold);
	void ClientServerChatDirectMessage(const struct FString& MessageText, const struct FLinearColor& MessageColor, bool bIsBold);
	void ClientSendFolderData(class UPrimalInventoryComponent* forInventory, TArray<struct FServerCustomFolder> ServerCustomFolder);
	void ClientSendArkDataPayloadEnd(const struct FGuid& ID, TEnumAsByte<EPrimalARKTributeDataType> ArkDataType);
	void ClientSendArkDataPayloadBegin(const struct FGuid& ID, TEnumAsByte<EPrimalARKTributeDataType> ArkDataType, const struct FString& DataClass, const struct FString& TagName, const struct FString& Name, TArray<struct FString> DataStats, uint32_t ID1, uint32_t ID2);
	void ClientSendArkDataPayload(const struct FGuid& ID, TEnumAsByte<EPrimalARKTributeDataType> ArkDataType, TArray<unsigned char> DataBytes);
	void ClientResetLastPartyData();
	void ClientRemoveItemFromSteamInventory(TArray<uint64_t> ItemSteamUserID, int Quantity);
	void ClientRemoveItemFromArk(class UPrimalInventoryComponent* forInventory, const struct FItemNetID& RemovedItemID);
	void ClientRemoveActorItem(class UPrimalInventoryComponent* forInventory, const struct FItemNetID& ItemId);
	void ClientRefreshSteamInventoryFinished(bool bSuccess);
	void ClientReceiveTribeLog(const struct FString& LogString);
	void ClientPlayLocalSound(class USoundBase* aSound);
	void ClientPlayHitMarkerStructureAlly();
	void ClientPlayHitMarkerStructure();
	void ClientPlayHitMarkerDinoAlly();
	void ClientPlayHitMarkerDino();
	void ClientPlayHitMarkerCharacterAlly();
	void ClientPlayHitMarkerCharacter();
	void ClientOpenMainMenu();
	void ClientNotifyTribeXP(float HowMuch);
	void ClientNotifyTorpidityIncrease();
	void ClientNotifyTamedDino(class UClass* DinoClass);
	void ClientNotifySummonedDino(class UClass* DinoClass);
	void ClientNotifyRemotePlayerDeath(const struct FString& PlayerName, const struct FString& AttackerName);
	void ClientNotifyPlayerKill(class AShooterCharacter* PlayerPawn, class APawn* VictimPawn);
	void ClientNotifyPlayerDeathReason(const struct FString& ReasonString);
	void ClientNotifyPlayerDeath(class APawn* InstigatingPawn);
	void ClientNotifyPaintFinished(bool bSuccess);
	void ClientNotifyMessageOfTheDay(const struct FString& Message, float timeToDisplay);
	void ClientNotifyListenServerOutOfRange();
	void ClientNotifyLevelUp(class APrimalCharacter* ForChar, int NewLevel);
	void ClientNotifyHitHarvest();
	void ClientNotifyEditText(class UClass* ForObjectClass, uint32_t ExtraID1, uint32_t ExtraID2, class UObject* ForObject);
	void ClientNotifyDinoKill(class APrimalDinoCharacter* InstigatingPawn, class APawn* VictimPawn);
	void ClientNotifyDinoDeath(const struct FString& DinoName, const struct FString& AttackerName, bool bIsVehicle);
	void ClientNotifyDefeatedDino(class UClass* DinoClass);
	void ClientNotifyCantHitHarvest();
	void ClientNotifyCantHarvest();
	void ClientNotifyAdmin();
	void ClientLoadArkItems(class UPrimalInventoryComponent* forInventory, TArray<struct FItemNetInfo> itemInfos);
	void ClientInsertActorItem(class UPrimalInventoryComponent* forInventory, const struct FItemNetInfo& itemInfo, const struct FItemNetID& InsertAfterItemID);
	void ClientHandleCosmeticsItems(bool bSuccess, TArray<struct FItemNetInfo> itemsInfo, bool GiveCosmetics);
	void ClientGetMessageOfTheDay(const struct FString& Message);
	void ClientFinishedReceivingActorItems(class UPrimalInventoryComponent* forInventory, bool bEquippedItems);
	void ClientFinishedLoadArkItems(class UPrimalInventoryComponent* forInventory);
	void ClientFailedRemoveSaddle();
	void ClientEndReceivingTribeLog();
	void ClientDoMultiUse(class UObject* ForObject, int UseIndex);
	void ClientCycleToClosestEnemies(const struct FVector& NewLoc, const struct FVector& camDir);
	void ClientCollectedAchievementItem(class UClass* ItemClass);
	void ClientChatMessage(const struct FChatMessage& Chat);
	void ClientAddItemToArk(class UPrimalInventoryComponent* forInventory, const struct FItemNetInfo& itemInfo, bool bFromLoad);
	void ClientAddFolderToInventoryComponent(class UPrimalInventoryComponent* forInventory, const struct FString& NewCustomFolderName, int InventoryCompType);
	void ClientAddFloatingText(const struct FVector_NetQuantize& AtLocation, const struct FString& FloatingTextString, const struct FColor& FloatingTextColor, float ScaleX, float ScaleY, float TextLifeSpan, const struct FVector& TextVelocity, float MinScale, float FadeInTime, float FadeOutTime);
	void ClientAddFloatingDamageText(const struct FVector_NetQuantize& AtLocation, int DamageAmount, int FromTeamID);
	void ClientAddEntryToCombatLogBox(const struct FString& DamageString, class UTexture2D* DamageIcon, TEnumAsByte<ESoTFDamageType> DamageType, uint64_t DamagedPlayerID);
	void ClientAddActorItem(class UPrimalInventoryComponent* forInventory, const struct FItemNetInfo& itemInfo, bool bEquipItem);
	void CheckRequestSpectator(const struct FString& InSpectatorPass);
	void CheckForPlayerInventory();
	void CheckforOrbiting();
	void CheckCheatsPassword(const struct FString& pass);
	void Cheat(const struct FString& Msg);
	void AutoCycle(float Duration);
	bool AllowTribeGroupPermission(TEnumAsByte<ETribeGroupPermission> TribeGroupPermission, class UObject* OnObject);
	void AdminCheat(const struct FString& Msg);
};


// Class ShooterGame.BiomeZoneVolume
// 0x0070 (0x04D0 - 0x0460)
class ABiomeZoneVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0460(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.BiomeZoneVolume");
		return ptr;
	}


	void OnEndOverlap(class AActor* Actor);
	void OnBeginOverlap(class AActor* Actor);
	bool IsPointUnderwater(class UWorld* ForWorld, const struct FVector& AtPoint, bool bFastPath, float MinimumWaterHeight);
	class ABiomeZoneVolume* GetBiomeZoneVolume(class UWorld* World, const struct FVector& Location);
};


// Class ShooterGame.BTService_FindTarget
// 0x0008 (0x0098 - 0x0090)
class UBTService_FindTarget : public UBTService_BlackboardBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0090(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.BTService_FindTarget");
		return ptr;
	}

};


// Class ShooterGame.BTService_UpdateAggro
// 0x0000 (0x0068 - 0x0068)
class UBTService_UpdateAggro : public UBTService
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.BTService_UpdateAggro");
		return ptr;
	}

};


// Class ShooterGame.BTTask_AttackTarget
// 0x0000 (0x0058 - 0x0058)
class UBTTask_AttackTarget : public UBTTaskNode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.BTTask_AttackTarget");
		return ptr;
	}

};


// Class ShooterGame.BTTask_GetRandomWanderDestination
// 0x0020 (0x00A0 - 0x0080)
class UBTTask_GetRandomWanderDestination : public UBTTask_BlackboardBase
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0080(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.BTTask_GetRandomWanderDestination");
		return ptr;
	}

};


// Class ShooterGame.CustomActorList
// 0x0010 (0x0438 - 0x0428)
class ACustomActorList : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0428(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.CustomActorList");
		return ptr;
	}


	void DestroyActors();
};


// Class ShooterGame.DraggableObjectInterface
// 0x0000 (0x0028 - 0x0028)
class UDraggableObjectInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DraggableObjectInterface");
		return ptr;
	}

};


// Class ShooterGame.CustomCanvasWidget
// 0x0050 (0x0448 - 0x03F8)
class UCustomCanvasWidget : public UButton
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x03F8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.CustomCanvasWidget");
		return ptr;
	}


	void OnDraggedClickedEventObject__DelegateSignature(class UWidget* draggeddWidget);
};


// Class ShooterGame.DataListEntryButton
// 0x00D0 (0x0518 - 0x0448)
class UDataListEntryButton : public UCustomCanvasWidget
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x0448(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListEntryButton");
		return ptr;
	}


	void ClickedButton(class UWidget* clickedWidget);
};


// Class ShooterGame.AdminPlayerInfoEntryButton
// 0x0050 (0x0568 - 0x0518)
class UAdminPlayerInfoEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0518(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.AdminPlayerInfoEntryButton");
		return ptr;
	}

};


// Class ShooterGame.AllPaintingsEntryButton
// 0x0030 (0x0548 - 0x0518)
class UAllPaintingsEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0518(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.AllPaintingsEntryButton");
		return ptr;
	}

};


// Class ShooterGame.AllPlayersEntryButton
// 0x0048 (0x0560 - 0x0518)
class UAllPlayersEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0518(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.AllPlayersEntryButton");
		return ptr;
	}

};


// Class ShooterGame.CheatFunctionInfoEntryButton
// 0x0038 (0x0550 - 0x0518)
class UCheatFunctionInfoEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0518(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.CheatFunctionInfoEntryButton");
		return ptr;
	}

};


// Class ShooterGame.DataListEntryButton_PrimalFolder
// 0x0048 (0x0560 - 0x0518)
class UDataListEntryButton_PrimalFolder : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0518(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListEntryButton_PrimalFolder");
		return ptr;
	}

};


// Class ShooterGame.DataListEntryButton_PrimalItem
// 0x0090 (0x05A8 - 0x0518)
class UDataListEntryButton_PrimalItem : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x90];                                      // 0x0518(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListEntryButton_PrimalItem");
		return ptr;
	}

};


// Class ShooterGame.HostSessionEntryButton
// 0x0058 (0x0570 - 0x0518)
class UHostSessionEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0518(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.HostSessionEntryButton");
		return ptr;
	}

};


// Class ShooterGame.LobbyMemberEntryButton
// 0x0050 (0x0568 - 0x0518)
class ULobbyMemberEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0518(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.LobbyMemberEntryButton");
		return ptr;
	}

};


// Class ShooterGame.OnlineLobbyEntryButton
// 0x01C0 (0x06D8 - 0x0518)
class UOnlineLobbyEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x1C0];                                     // 0x0518(0x01C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.OnlineLobbyEntryButton");
		return ptr;
	}

};


// Class ShooterGame.OnlineSessionEntryButton
// 0x01C0 (0x06D8 - 0x0518)
class UOnlineSessionEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x1C0];                                     // 0x0518(0x01C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.OnlineSessionEntryButton");
		return ptr;
	}

};


// Class ShooterGame.ServerInfoInfoEntryButton
// 0x0048 (0x0560 - 0x0518)
class UServerInfoInfoEntryButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0518(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.ServerInfoInfoEntryButton");
		return ptr;
	}

};


// Class ShooterGame.TopRankedDataListButton
// 0x0040 (0x0558 - 0x0518)
class UTopRankedDataListButton : public UDataListEntryButton
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0518(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.TopRankedDataListButton");
		return ptr;
	}

};


// Class ShooterGame.DraggedDecoratorWidget
// 0x0018 (0x0460 - 0x0448)
class UDraggedDecoratorWidget : public UCustomCanvasWidget
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0448(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DraggedDecoratorWidget");
		return ptr;
	}

};


// Class ShooterGame.HUDOVerlayWidget
// 0x0048 (0x0490 - 0x0448)
class UHUDOVerlayWidget : public UCustomCanvasWidget
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0448(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.HUDOVerlayWidget");
		return ptr;
	}

};


// Class ShooterGame.ProgressBarWidget
// 0x00F8 (0x0540 - 0x0448)
class UProgressBarWidget : public UCustomCanvasWidget
{
public:
	unsigned char                                      UnknownData00[0xF8];                                      // 0x0448(0x00F8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.ProgressBarWidget");
		return ptr;
	}

};


// Class ShooterGame.SpawnMapWidget
// 0x0058 (0x04A0 - 0x0448)
class USpawnMapWidget : public UCustomCanvasWidget
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0448(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.SpawnMapWidget");
		return ptr;
	}

};


// Class ShooterGame.StoreItemWidget
// 0x00C0 (0x0508 - 0x0448)
class UStoreItemWidget : public UCustomCanvasWidget
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0448(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.StoreItemWidget");
		return ptr;
	}

};


// Class ShooterGame.UI_PreviewWidget
// 0x0128 (0x0570 - 0x0448)
class UUI_PreviewWidget : public UCustomCanvasWidget
{
public:
	unsigned char                                      UnknownData00[0x128];                                     // 0x0448(0x0128) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.UI_PreviewWidget");
		return ptr;
	}

};


// Class ShooterGame.DamageVolumeBase
// 0x0030 (0x0490 - 0x0460)
class ADamageVolumeBase : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0460(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DamageVolumeBase");
		return ptr;
	}


	void OnEndOverlap(class AActor* Actor);
	void OnBeginOverlap(class AActor* Actor);
};


// Class ShooterGame.DamageVolumeSwamp
// 0x0008 (0x0498 - 0x0490)
class ADamageVolumeSwamp : public ADamageVolumeBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0490(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DamageVolumeSwamp");
		return ptr;
	}

};


// Class ShooterGame.DataListEntryWidget
// 0x00B0 (0x0290 - 0x01E0)
class UDataListEntryWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x01E0(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListEntryWidget");
		return ptr;
	}


	void OnDraggedClickedEventObject(class UWidget* draggeddWidget);
	void InitializeMeDefaults();
	class UDataListEntryButton* GetDataListButton();
};


// Class ShooterGame.DataListPanel
// 0x0130 (0x0708 - 0x05D8)
class UDataListPanel : public UScrollBox
{
public:
	unsigned char                                      UnknownData00[0x130];                                     // 0x05D8(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DataListPanel");
		return ptr;
	}

};


// Class ShooterGame.DayCycleAmbientSound
// 0x0030 (0x0458 - 0x0428)
class ADayCycleAmbientSound : public AActor
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0428(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DayCycleAmbientSound");
		return ptr;
	}

};


// Class ShooterGame.HUDInterface
// 0x0000 (0x0028 - 0x0028)
class UHUDInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.HUDInterface");
		return ptr;
	}

};


// Class ShooterGame.DayCycleManager
// 0x00A0 (0x04C8 - 0x0428)
class ADayCycleManager : public AInfo
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0428(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DayCycleManager");
		return ptr;
	}


	bool IsDaytime();
};


// Class ShooterGame.DestroyedMeshActor
// 0x0018 (0x0460 - 0x0448)
class ADestroyedMeshActor : public ADestructibleActor
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0448(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DestroyedMeshActor");
		return ptr;
	}


	void SetNoCollisionProfile();
};


// Class ShooterGame.DroppedItem
// 0x01A0 (0x05C8 - 0x0428)
class ADroppedItem : public AActor
{
public:
	unsigned char                                      UnknownData00[0x1A0];                                     // 0x0428(0x01A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DroppedItem");
		return ptr;
	}


	void ForceSleep();
};


// Class ShooterGame.DroppedItemEgg
// 0x0038 (0x0600 - 0x05C8)
class ADroppedItemEgg : public ADroppedItem
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x05C8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DroppedItemEgg");
		return ptr;
	}


	void NetSpawnDinoEmitter();
};


// Class ShooterGame.DroppedItemLowQuality
// 0x0000 (0x05C8 - 0x05C8)
class ADroppedItemLowQuality : public ADroppedItem
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DroppedItemLowQuality");
		return ptr;
	}

};


// Class ShooterGame.DroppedItemTorch
// 0x0018 (0x05E0 - 0x05C8)
class ADroppedItemTorch : public ADroppedItemLowQuality
{
public:
	unsigned char                                      UnknownData00[0xCAE];                                     // 0x05C8(0x0CAE) MISSED OFFSET
	bool                                               FireIsOn;                                                 // 0x1276(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.DroppedItemTorch");
		return ptr;
	}


	void OnRep_FireIsOn();
};


// Class ShooterGame.FadingDestructibleActor
// 0x0050 (0x0498 - 0x0448)
class AFadingDestructibleActor : public ADestructibleActor
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0448(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.FadingDestructibleActor");
		return ptr;
	}


	void SetupFade();
};


// Class ShooterGame.HUDStatusBarsWidget
// 0x0120 (0x0300 - 0x01E0)
class UHUDStatusBarsWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x120];                                     // 0x01E0(0x0120) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.HUDStatusBarsWidget");
		return ptr;
	}

};


// Class ShooterGame.KeyInputWidget
// 0x0028 (0x04A8 - 0x0480)
class UKeyInputWidget : public UEditableText
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0480(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.KeyInputWidget");
		return ptr;
	}

};


// Class ShooterGame.MatineeCapture
// 0x0030 (0x0458 - 0x0428)
class AMatineeCapture : public AActor
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0428(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.MatineeCapture");
		return ptr;
	}

};


// Class ShooterGame.NPCSpawnEntriesContainer
// 0x0028 (0x0050 - 0x0028)
class UNPCSpawnEntriesContainer : public UObject
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0028(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.NPCSpawnEntriesContainer");
		return ptr;
	}

};


// Class ShooterGame.NPCZoneManager
// 0x00F8 (0x0520 - 0x0428)
class ANPCZoneManager : public AInfo
{
public:
	unsigned char                                      UnknownData00[0xF8];                                      // 0x0428(0x00F8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.NPCZoneManager");
		return ptr;
	}


	TArray<class APrimalDinoCharacter*> StaticSpawnNPCs(class UObject* WorldContext, class ANPCZoneManager* AtZoneManager, class UClass* TheNPCSpawnEntries, const struct FVector& AtSpawnPoint, const struct FRotator& AtRotation, int UseSpawnVolumeIndex);
};


// Class ShooterGame.NPCZoneSpawnVolume
// 0x0000 (0x0460 - 0x0460)
class ANPCZoneSpawnVolume : public AVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.NPCZoneSpawnVolume");
		return ptr;
	}

};


// Class ShooterGame.NPCZoneVolume
// 0x0040 (0x04A0 - 0x0460)
class ANPCZoneVolume : public AVolume
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0460(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.NPCZoneVolume");
		return ptr;
	}


	void OnEndOverlap(class AActor* Actor);
	void OnBeginOverlap(class AActor* Actor);
};


// Class ShooterGame.ObjectSerializer
// 0x0000 (0x0028 - 0x0028)
class UObjectSerializer : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.ObjectSerializer");
		return ptr;
	}

};


// Class ShooterGame.PaintingTexture
// 0x0038 (0x0060 - 0x0028)
class UPaintingTexture : public UObject
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0028(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PaintingTexture");
		return ptr;
	}

};


// Class ShooterGame.PaintingCache
// 0x00C0 (0x00E8 - 0x0028)
class UPaintingCache : public UObject
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0028(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PaintingCache");
		return ptr;
	}

};


// Class ShooterGame.PaintingStreamingComponent
// 0x0030 (0x0138 - 0x0108)
class UPaintingStreamingComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0108(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PaintingStreamingComponent");
		return ptr;
	}


	void ServerSendNextChunk(class UStructurePaintingComponent* PaintingComponent);
	void ServerRequestPaintingStream(class UStructurePaintingComponent* PaintingComponent);
	void ServerCancelPaintingStream(class UStructurePaintingComponent* PaintingComponent);
	void ClientRecieveChunk(class UStructurePaintingComponent* PaintingComponent, TArray<unsigned char> Bytes);
	void ClientEndStreamingJob(class UStructurePaintingComponent* PaintingComponent);
	void ClientCancelSteamingJob(class UStructurePaintingComponent* PaintingComponent);
	void ClientBeginStreamingJob(class UStructurePaintingComponent* PaintingComponent, int Revision);
};


// Class ShooterGame.PreviewImage
// 0x00C0 (0x00E8 - 0x0028)
class UPreviewImage : public UObject
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0028(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PreviewImage");
		return ptr;
	}

};


// Class ShooterGame.PrimalAIState
// 0x0038 (0x0060 - 0x0028)
class UPrimalAIState : public UObject
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0028(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalAIState");
		return ptr;
	}


	void TickAnimationStateEvent(float DeltaTime, const struct FName& CustomEventName, TEnumAsByte<ENetRole> Role);
	void TickAnimationState(float DeltaTime, const struct FName& CustomEventName, TEnumAsByte<ENetRole> Role);
	void StartAnimationStateEvent(const struct FName& CustomEventName, TEnumAsByte<ENetRole> Role);
	void StartAnimationState(const struct FName& CustomEventName, TEnumAsByte<ENetRole> Role);
	bool ShouldSkipRangeCheckEvent();
	bool ShouldSkipIntervalCheckEvent();
	void SetLastAttackTime();
	void SetInAnimationStateActive(bool Value);
	void OnTickEvent(float DeltaSeconds);
	void OnTick(float DeltaSeconds);
	void OnEndEvent();
	void OnEnd();
	void OnChildStateEndedEvent(class UPrimalAIState* PrimalAIState);
	bool OnCanUseStateEvent();
	void OnBeginEvent(class UPrimalAIState* InParentState);
	void OnBegin(class UPrimalAIState* InParentState);
	void EndAnimationStateEvent(const struct FName& CustomEventName, TEnumAsByte<ENetRole> Role);
	void EndAnimationState(const struct FName& CustomEventName, TEnumAsByte<ENetRole> Role);
	bool CanUseState();
};


// Class ShooterGame.PrimalAIStateDinoMeleeState
// 0x0018 (0x0078 - 0x0060)
class UPrimalAIStateDinoMeleeState : public UPrimalAIState
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0060(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalAIStateDinoMeleeState");
		return ptr;
	}

};


// Class ShooterGame.PrimalAIStateDinoFlyerGrab
// 0x0008 (0x0080 - 0x0078)
class UPrimalAIStateDinoFlyerGrab : public UPrimalAIStateDinoMeleeState
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalAIStateDinoFlyerGrab");
		return ptr;
	}

};


// Class ShooterGame.PrimalAIStateDinoRangedState
// 0x0028 (0x0088 - 0x0060)
class UPrimalAIStateDinoRangedState : public UPrimalAIState
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0060(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalAIStateDinoRangedState");
		return ptr;
	}

};


// Class ShooterGame.PrimalAIStateDinoSpiderMinions
// 0x0078 (0x00D8 - 0x0060)
class UPrimalAIStateDinoSpiderMinions : public UPrimalAIState
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0060(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalAIStateDinoSpiderMinions");
		return ptr;
	}

};


// Class ShooterGame.PrimalAIStateDinoSpiderRangedAcidState
// 0x0018 (0x0078 - 0x0060)
class UPrimalAIStateDinoSpiderRangedAcidState : public UPrimalAIState
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0060(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalAIStateDinoSpiderRangedAcidState");
		return ptr;
	}

};


// Class ShooterGame.PrimalAIStateDinoSpiderRangedWebState
// 0x0020 (0x0080 - 0x0060)
class UPrimalAIStateDinoSpiderRangedWebState : public UPrimalAIState
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0060(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalAIStateDinoSpiderRangedWebState");
		return ptr;
	}

};


// Class ShooterGame.PrimalBuffPersistentData
// 0x0008 (0x0030 - 0x0028)
class UPrimalBuffPersistentData : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalBuffPersistentData");
		return ptr;
	}

};


// Class ShooterGame.PrimalCableComponent
// 0x0050 (0x0640 - 0x05F0)
class UPrimalCableComponent : public UMeshComponent
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x05F0(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalCableComponent");
		return ptr;
	}

};


// Class ShooterGame.TargetableInterface
// 0x0000 (0x0028 - 0x0028)
class UTargetableInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.TargetableInterface");
		return ptr;
	}


	class UObject* ToUObject();
};


// Class ShooterGame.PrimalCharacter
// 0x08C0 (0x0ED0 - 0x0610)
class APrimalCharacter : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0xD4A];                                     // 0x0610(0x0D4A) MISSED OFFSET
	unsigned char                                      UnknownData01 : 4;                                        // 0x135A(0x0001)
	unsigned char                                      bIsDead : 1;                                              // 0x135A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, EditConst, SaveGame)
	unsigned char                                      UnknownData02 : 3;                                        // 0x135A(0x0001)
	unsigned char                                      bIsSleeping : 1;                                          // 0x135B(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, Transient, SaveGame)
	TWeakObjectPtr<class APrimalDinoCharacter>         MountedDino;                                              // 0x135C(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	class UStructurePaintingComponent*                 PaintingComponent;                                        // 0x135D(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData)
	TArray<struct FVector_NetQuantize>                 ReplicatedRagdollPositions;                               // 0x135E(0x0010) (Net, ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ShooterGame.PrimalCharacter");
		return ptr;
	}


	void UpdateTickSetting();
	float TakeDamage(float Damage, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
	void StopAnimEx(class UAnimMontage* AnimMontage, bool bReplicate, bool bReplicateToOwner, float BlendOutTime);
	void StartForceSkelUpdate(float ForTime, bool bForceUpdateMesh, bool bServerOnly);
	void SleepBodies();
	void SetStatusStateDefinition(TEnumAsByte<EPrimalCharacterStatusState> StatusStateType, bool bUsed, int StatusValueThresholdIndex);
	void SetDeathByRing();
	void ServerTryPoop();
	void ServerSetRunning(bool bNewRunning);
	void ServerRequestDrag();
